Revit 2027 API
BuiltInFailures.StairRampFailures.WinderParallelLegsFailure Property
 Two consecutive legs are parallel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderParallelLegsFailure { get; }
Public Shared ReadOnly Property WinderParallelLegsFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderParallelLegsFailure {
	FailureDefinitionId^ get ();
}
static member WinderParallelLegsFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace